---
kind: other
id: Methods.T:Autodesk.Revit.DB.Sweep
source: html/bd4a2c72-07ee-5102-b7dd-36ee93995d2d.htm
---
# Sweep Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.